var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "万██",
    sex: "男",
    age: "19",
    phone: "13902988446",
    email: "2760913192@qq.com",
    address: "广州大学",
    qq: "2760913192",
    log: "Zhongye",
    excpect_work: "HTML/CSS/JS前端",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "从事于710工程",
        "南漂中",
        "in GZHU",
        "Where We Go When We Fade...",
        "And When Will We Fade Away... ",
      //   "有智者立长志，无志者长立志。",
      //   "那些过去的眼泪终将风干在记忆里。",
     //    "真相，是为了剿灭幻想。",
     //    "我欲将心向明月，奈何明月照沟渠。",
     //    "春风得意马蹄疾，一日看尽长安花。",
     //    "天凉好个秋！",
     //   "老骥伏枥，志在千里。烈士暮年，壮心不已。",
     //    "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
     //    "我们必须拿我们所有的， 去换我们所没有的",
     //    "蒹葭苍苍，白露为霜；所谓伊人，在水一方。",
     //   "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "南漂中，目前在广州<br>" +
             "专业为数据科学与大数据技术<br>" +
             "广州大学大二在读<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫████，广州大学数据科学与大数据技术大二在读。我期望的工作岗位是████████████████。</p>" +
        "<p>我有着较多的前端经验，计算机基础知识掌握扎实，能够在工作中很好的完成自己的任务。此外，我有着充满激情的工作态度，团队协同作战能力强，同时我也具备独立开发的能力，擅于发现并解决问题。我的执行力强、责任感高、集体荣誉感强、敢于担当，能够接受加班或出差等安排</p>" +
        "<p>十分期待与您的联系!</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
       // ["Java", 80, "red"],
       // ["GoLang", 77, "blue"],
       // ["SQL", 75, "#1abc9c"],
        ["HTML5", 67, "#1abc9c"],
        ["CSS3", 60, "yellow"],
        ["JavaScript", 70, "red"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>操作系统、计算机网络等编程基础知识良好。</li>" +
        "     <li>熟悉HTML、CSS、JavaScript以及相应前端知识。</li>" +
        "     <li>[已编辑]</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["https://pic1.zhimg.com/v2-d556c8e739d2a99c8964fd44439234ec_b.jpg", "https://zhongye1.github.io/", "个人博客", "这里记录了我的大学课程及一些前端项目和笔记<br>持续更新"],
        ["./images/pro-2.png", "https://zhongye1.github.io/posts/e11696b0.html", "番剧实景巡礼地图", "网站项目其二<br>2021/7/23"],
        ["https://pic3.zhimg.com/80/v2-d9766956d5c85c2780e4c5008fd946ca_1440w.jpg", "https://zhongye1.github.io/posts/f4171415.html", "广州大学选课脚本", "项目其一"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["2020/7/1 — 2021/8/10", "<br>红岸基地",
            "<p><strong> 红岸系统 </strong></p>" +
            "<p>负责其自编译系统及进行调试工作，红岸系统最初用于[已编辑]。随着[已编辑]，其承担了一些射电天文观测项目，曾经是国内最大的射电望远镜。后来，随着其他射电天文观测基地的建立，红岸的研究主要集中在对太阳电磁活动的观测和分析上。</p>" +
            "<p> </p>"
        ],

        ["2020/7/1 — 2021/8/10", "<br>710工程-黄埔",
            "<p><strong>project-710</strong></p>" +
            "<p>710工程，[多余信息已编辑]</p>" +
            "<p>  </p>"
        ]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2024-10-28", "710工程", "前往广州黄埔从事相关工作，██████████████，██████████████，████████████████████████████，██████████████。"],
        ["2024-11-24", "[已编辑]", "[多余信息已编辑]"],
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        // ["./svg/LeetCode.svg", "https://leetcode-cn.com/u/happysnaker/", "我的力扣主页"],
        ["./svg/github.svg", "https://github.com/zhongye1", "我的GitHub主页"],
        ["./svg/博客.svg", "https://zhongye1.github.io/", "我的个人博客"],
        //["./svg/掘金.svg", "https://juejin.cn/user/3853167638625000", "我的掘金主页"],
        //["./svg/知乎.svg", "https://www.zhihu.com/people/tian-xia-you-dao-81", "我的知乎主页"]
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "https://pic2.zhimg.com/80/v2-117e01b81042be7560b0d40b59b42e83_720w.webp",//"./images/2.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}
